{
    "id": "7bf3eebf-21a1-4ecb-b45d-0cf3caa4a654",
    "artist": "Cody Johnson & Carrie Underwood",
    "song": "I'm Gonna Love You",
    "youtube_url": "https://www.youtube.com/watch?v=yy9PuYMU29g",
    "uploader": "Cody Johnson",
    "duration": 185,
    "views": 11334916,
    "like_count": 144279,
    "release_date": "20240927",
    "thumbnail": "https://i.ytimg.com/vi_webp/yy9PuYMU29g/maxresdefault.webp",
    "tags": [
        "Cody Johnson",
        "CoJo",
        "CoJo Nation",
        "Texas Country",
        "Texas Country Music",
        "Country Music",
        "Human The Double Album",
        "’Til You Can’t",
        "till you can't cody johnson",
        "dear rodeo cody johnson",
        "cody johnson til you can't",
        "dear rodeo",
        "country music",
        "on my way to you cody johnson",
        "Country music playlist",
        "Country playlist",
        "Country hits",
        "leather",
        "the painter",
        "cma awards",
        "country music 2024",
        "cma fest",
        "cma fest 2024",
        "cma fest tv special",
        "dirt cheap",
        "dirt cheap video",
        "that's texas"
    ],
    "description": "Cody Johnson - I'm Gonna Love You (with Carrie Underwood) [Official Music Video]\n\nListen to the 'Leather' album: https://codyjohnson.lnk.to/leather\n\nSubscribe to Cody's channel for all the latest: https://bit.ly/2D9PWQo\n\nFollow Cody on socials! \nTwitter: https://www.twitter.com/CodyJohnsonBand\nInstagram: https://CodyJohnson.lnk.to/instagram \nFacebook: https://CodyJohnson.lnk.to/facebook\nWebsite: https://www.codyjohnsonmusic.com\nSpotify: https://CodyJohnson.lnk.to/spotify\n\nThe official YouTube channel of Cody Johnson.\n \nCody Johnson has established a following of passionately loyal fans who regularly sell out shows across the country. The artist that media has touted “just might be the future of real country music” has skyrocketed success with numerous celebrated albums: Leather Deluxe Edition, Leather, Human The Double Album, A Cody Johnson Christmas, Cody Johnson & The Rockin’ CJB Live, and Ain’t Nothin’ To It plus an award-winning feature-length documentary “Dear Rodeo: The Cody Johnson Story.” Cody has 42 Gold and Platinum certifications, has nearly 8 billion global streams and three #1 singles. \n\nCody’s brand-new studio project Leather Deluxe Edition is out now. The deluxe album contains 13 brand new tracks and also includes all 12 songs from his Leather album released last November for a total of 25 songs. Produced by Trent Willmon, the album is available in stores, including vinyl, and at all digital retailers and streaming platforms HERE.\n\nCody has five nominations for the upcoming “The 58th Annual CMA Awards” including Male Vocalist of the Year, Album of the Year for Leather, Single of the Year for “Dirt Cheap” and two nominations in Music Video of the Year for both “The Painter” and “Dirt Cheap.” The CMA Awards will be broadcast live from Nashville’s Bridgestone Arena Wednesday, November 20 on ABC and the next day on Hulu.\n\nHis numerous industry honors include recognition as a CMT Artist of The Year, three CMT Music Awards wins, two CMA Awards, being named “Best New Country Artist” at the iHeart Music. His #1 His television appearances have entertained fans on the Today Show, the Kelly Clarkson Show and the Tonight Show Starring Jimmy Fallon in addition to outstanding live tv performances at the iHeart Music Awards, the ACM Awards, CMA Awards, CMT Music Awards, CMT Giants honoring Vince Gill, and the CMT Artist of the Year Special. \n\n© 2024 CoJo Music / 2023 Warner Music Nashville LLC\n\n#CodyJohnson #ImGonnaLoveYou #CarrieUnderwood",
    "last_updated": 1742628153
}