{
    "id": "eb0ecd02-fc71-4d9f-a043-a4da7a0e9815",
    "artist": "Gracie Abrams",
    "song": "That's So True",
    "youtube_url": "https://www.youtube.com/watch?v=7UpcmHTRg3s",
    "uploader": "stylizt",
    "duration": 165,
    "views": 1690110,
    "like_count": 25953,
    "release_date": "",
    "thumbnail": "https://i.ytimg.com/vi/7UpcmHTRg3s/maxresdefault.jpg",
    "tags": [],
    "description": "Fan-made music video for “That’s So True” by Gracie Abrams from her album “The Secret of Us”\n\nLyrics:\n\nI could go and read your mind\nThink about your dumb face all the time\nLiving in your glass house, I'm outside, uh\nLooking into big blue eyes\nDid it just to hurt me, make me cry\nSmiling through it all, yeah, that's my life\nYou're an idiot, now I'm sure\nNow I'm positive, I should go and warn her\nOoh, bet you're thinking, \"She's so cool\"\nKicking back on your couch, making eyes from across the room\nWait, I think I've been there too\nWhat'd she do to get you off? (Uh-huh)\nTaking down her hair like, oh, my God\nTaking off your shirt, I did that once\nOr twice, uh\nNo, I know, I know I'll fuck off (uh-huh)\nBut I think I like her, she's so fun\nWait, I think I hate her, I'm not that evolved\nI'm sorry she's missing it, sad, sad boy\nNot my business, but I had to warn ya\nOoh, bet you're thinking, \"She's so cool\"\nKicking back on your couch, making eyes from across the room\nWait, I think I've been there too\nOoh, you've got me thinking, \"She's so cool\"\nBut I know what I know and you're just another dude\nOoh, that's so true\nMade it out alive, but I think I lost it\nSaid that I was fine, said it from the coffin\nRemember how I died when you started walking?\nThat's my life, that's my life\nI'll put up a fight, taking out my earrings\nDon't you know the vibe? Don't you know the feeling?\nYou should spend the night, catch me on your ceiling\nThat's your prize, that's your prize\nWell\nMm, bet you're thinking, \"She's so cool\"\nKicking back on your couch, making eyes from across the room\nWait, I think I've been there too\nOoh, you've got me thinking, \"She's so cool\"\nBut I know what I know and you're just another dude\nOoh, that's so true, ooh, oh"
}